blog/2014/12/指针相关问题.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>指针相关问题</title>
<!-- 2014-12-03 Wed 22:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">指针相关问题</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 结构体与指针</a></li>
<li><a href="#sec-2">2. 参数与指针</a></li>
</ul>
</div>
</div>
<hr  />
<p>
最近在review一个同事写的代码，实在看不下去了自己重写了大部分，在重写的过程中，有些用指针的地方也没有一次就写好，还是靠编译器来找出的错误，这里简单总结一下。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 结构体与指针</h2>
<div class="outline-text-2" id="text-1">
<p>
大型程序中结构体包含结构体的情况很常见，而且有时包含好多层，有的定义的是变量，有的定义的是指针，在引用时，很容易用错“.”和“-&gt;”。其实只要牢记一点，不要看你引用的成员是否是指针，而是看上一层定义是否是是指针，说起来有些拗口，请看下面例子：
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #e5786d;">#include</span> <span style="color: #95e454;">&lt;stdlib.h&gt;</span>

<span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st1</span> {
   <span style="color: #92a65e; font-weight: bold;">int</span>  <span style="color: #cae682;">a</span>;
   <span style="color: #92a65e; font-weight: bold;">int</span> *<span style="color: #cae682;">p</span>;
};

<span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st2</span> {
   <span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st1</span> <span style="color: #cae682;">s1</span>;
   <span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st1</span> *<span style="color: #cae682;">s2</span>;
};

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>()
{
   <span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st2</span>  <span style="color: #cae682;">s</span>;
   <span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st2</span> *<span style="color: #cae682;">ps</span>;

   s.s1.a = 1;
   s.s1.p = <span style="color: #e5786d;">NULL</span>;
   s.s2 = (<span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st1</span>*)malloc(<span style="color: #8ac6f2; font-weight: bold;">sizeof</span>(<span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st1</span>));
   s.s2-&gt;a = 1;
   s.s2-&gt;p = <span style="color: #e5786d;">NULL</span>;

   ps = (<span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st2</span>*)malloc(<span style="color: #8ac6f2; font-weight: bold;">sizeof</span>(<span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st2</span>));
   ps-&gt;s1.a = 0;
   ps-&gt;s1.p = <span style="color: #e5786d;">NULL</span>; <span style="color: #99968b;">/* </span><span style="color: #99968b;">&#22240;&#20026;struct _st1&#20013;p&#26159;&#25351;&#38024;&#65292;&#25152;&#20197;&#23481;&#26131;&#20889;&#25104; ps-&gt;s1-&gt;p&#65292;&#20294;&#23454;&#38469;&#19978;&#26159;&#30475;s1&#26159;&#21542;&#26159;&#25351;&#38024;&#65292;&#36825;&#37324;&#26159;s1&#19981;&#26159;&#25351;&#38024;&#65292;&#25152;&#20197;&#29992;"." </span><span style="color: #99968b;">*/</span>
   ps-&gt;s2 = (<span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st1</span>*)malloc(<span style="color: #8ac6f2; font-weight: bold;">sizeof</span>(<span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">_st1</span>));
   ps-&gt;s2-&gt;a = 0;
   ps-&gt;s2-&gt;p = <span style="color: #e5786d;">NULL</span>;

   <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 参数与指针</h2>
<div class="outline-text-2" id="text-2">
<p>
在使用指针传参数时，输出参数使用高一级的指针，也就是说在函数中分配内存要用二级指针，要想分配内存多个存放指针，那你就需要三级指针。
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #e5786d;">#include</span> <span style="color: #95e454;">&lt;stdlib.h&gt;</span>

<span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">func</span>(<span style="color: #92a65e; font-weight: bold;">char</span> **<span style="color: #cae682;">p</span>)
{
   *p = malloc(10);
}

<span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">func2</span>(<span style="color: #92a65e; font-weight: bold;">char</span> ***<span style="color: #cae682;">p</span>)
{
   *p = malloc(<span style="color: #8ac6f2; font-weight: bold;">sizeof</span>(<span style="color: #92a65e; font-weight: bold;">void</span> *)*2);
}

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>()
{
   <span style="color: #92a65e; font-weight: bold;">char</span> *<span style="color: #cae682;">p1</span>  = <span style="color: #e5786d;">NULL</span>;
   <span style="color: #92a65e; font-weight: bold;">char</span> *<span style="color: #cae682;">p2</span>  = <span style="color: #e5786d;">NULL</span>;
   <span style="color: #92a65e; font-weight: bold;">char</span> **<span style="color: #cae682;">pp</span> = <span style="color: #e5786d;">NULL</span>;

   func(&amp;p1);
   func(&amp;p2);
   func2(&amp;pp);
   pp[0] = p1;
   pp[1] = p2;

   free(p1);
   free(p2);
   free(pp);

   <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<p>
暂时先说这两个问题，后面有时间在补充。
</p>

<p>
<a href="http://madahah.github.io/index.html">首页</a>  <a href="../../%E7%BC%96%E7%A8%8B.html">编程</a>
</p>
<hr  />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2014-12-03 Wed 22:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
